{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": {"m": 3, "name": "MaxNorm", "axis": 0}, "b_constraint": null, "name": "convolution2d_15", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 25, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "input_dtype": "float32", "border_mode": "same", "batch_input_shape": [null, 4, 1, 101], "W_regularizer": null, "activation": "relu", "nb_row": 1}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_15", "trainable": true, "dim_ordering": "th", "pool_size": [1, 101], "strides": [1, 1], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_15"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_29", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 16, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 32}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_15"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_30", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 32, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_15"}}]}